# Прослеживать траекторию полета самолета.
SHOW_TRACK = False  # FALSE

# Отображать ли маяки.
SHOW_VORDME = True  # TRUE
SHOW_DME = True  # TRUE
SHOW_NDB = True  # TRUE

APP_TITLE = "Авиатренажер ADF Boeing 747 и Airbus A320"

# Разрешения по-умолчанию.
STANDART_RESOLUTION = (1920, 1080)
# Ограничения зоны полета для карты.
MAPS_WALLS = ((70, 100), (1800, 950))
# Размер захвата мини-карты с карты.
MINI_MAPS_BOUNDARIES = (256, 256)
# Точка, на которую будет выходить ВС при сближении с границей карты.
DIVERT_POINT = (955, 538)

# Режимы изменения ускорения времени для самолета.
BOOST_MODES = (0, 1, 3, 5, 10, 15, 25)
# Режим по умолчанию.
BOOST_MODE_DEFAULT = BOOST_MODES[1]

# Размеры иконок.
MARKER_SIZE = (25, 40)
TPHERE_BANNER_SIZE = (256, 109)
MARKER_BANNER_SIZE = (256, 114)

# Диапазон частот.
ADF_RANGE = (150.0, 1750.0)
VOR_RANGE = (108.00, 117.95)

# Максимальная отображаемая дальность DME.
DME_MAX_DIST = 280

# Координаты и частоты маяков.
MARKERS = {
    "VORDME": {
        "points": {
            "113.8": (180, 884),
            "108.4": (240, 465),
            "113.4": (1011, 417),
            "113.7": (1110, 386),
            "108.8": (1498, 773)
        },
        "color": "red"
    },
    "DME": {
        "points": {
            "110.8": (1270, 816),
            "108.2": (1547, 748),
            "111.5": (1736, 574)
        },
        "color": "blue"
    },
    "NDB": {
        "points": {
            "445.0": (1447, 152),
            "696.0": (596, 190),
            "332.0": (1027, 442),
            "408.0": (1120, 366)
        },
        "color": "purple"
    },
    "NDBDME": {
        "points": {
            "995.0": (1228, 531),
            "108.1": (1228, 531)
        },
        "color": "orange"
    }
}
